Reports/Отчет2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>Отчет2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Отчет2/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере().Показать();           
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.ТолькоПросмотр = Истина;
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
   
	ДатаФормирования = Отчет.ДатаФормирования;
	КонкрТовар = Товар.Наименование;
	
	
	//ДатаОтчета = ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, ТекущаяДата());
	ДатаОтчета = ДатаФормирования;
	
	Объект1 = РеквизитФормыВЗначение("Отчет");
	Макет = Объект1.ПолучитьМакет("Макет");

       
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.ДатаФормирования = Формат(ДатаОтчета, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.Товар = КонкрТовар;
   
    ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
   
    Табдок.Вывести(ОбластьШапкаТаблицы);
   
    Запрос = Новый Запрос;
		
	Запрос.Текст =
        "ВЫБРАТЬ
		| ЦеныТоваров.Период,
		| ЦеныТоваров.Товар,
        | ЦеныТоваров.Цена
        |ИЗ
        | РегистрСведений.ЦеныТоваров КАК ЦеныТоваров
		|ГДЕ
		| ЦеныТоваров.Период = &ДатаФормирования И ЦеныТоваров.Товар = &Товар";
		
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаОтчета);
	Запрос.УстановитьПараметр("Товар", Товар);

    РезультатЗапроса = Запрос.Выполнить();   
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
   
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбластьСтрокаТаблицы.Параметры.Товар = ВыборкаДетальныеЗаписи.Товар;
        ОбластьСтрокаТаблицы.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
        ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 
    Возврат ТабДок;
КонецФункции
